app/controllers/mixes_controller.rb

  def index
    @mixes = Mix.all
---
SELECT "mixes".* FROM "mixes"

  def show
    @mix = Mix.find_by(id: params[:id])
---
SELECT "mixes".* FROM "mixes" WHERE "mixes"."id" = 1 LIMIT 1

  def create
    @mix = Mix.new
    @mix.name = params[:name]
    @mix.url = params[:url]
    @mix.last_modified_string = params[:last_modified_string]
    @mix.size = params[:size]
    @mix.event = params[:event]
    @mix.dj_id = params[:dj_id]

    if @mix.save
---
INSERT INTO "mixes" ("dj_id", "event", "last_modified_string", "name", "size", "url") VALUES (?, ?, ?, ?, ?, ?)

  def edit
    @mix = Mix.find_by(id: params[:id])
---
SELECT "mixes".* FROM "mixes" WHERE "mixes"."id" = 1 LIMIT 1

  def update
    @mix = Mix.find_by(id: params[:id])
    @mix.name = params[:name]
    @mix.url = params[:url]
    @mix.last_modified_string = params[:last_modified_string]
    @mix.size = params[:size]
    @mix.event = params[:event]
    @mix.dj_id = params[:dj_id]

    if @mix.save
---
SELECT "mixes".* FROM "mixes" WHERE "mixes"."id" = 1 LIMIT 1
UPDATE "mixes" SET "name" = ?, "url" = ?, "last_modified_string" = ?, "size" = ?, "event" = ? WHERE "mixes"."id" = 2  [["name", "JustinReedRK13.mp3 "], ["url", "http://www.illmeasures.com/media/audio/RK13/JustinReedRK13.mp3"], ["last_modified_string", "07-Oct-2013 10:42"], ["size", "144M"], ["event", "RK13"]]